import React, { Fragment, Component } from "react";
import { Box, Image, Textarea, Button } from "@chakra-ui/core";
import logo from "../img/logo.png";
import dolphin from "../img/dolphin.png";
import { ethers } from "../../../buidler/node_modules/ethers";
import { observer, inject } from "mobx-react";
import { toJS } from "mobx";

const TitleObserver = inject("store")(
	observer(
		class Title extends Component {
			constructor(props) {
				super(props);
				this.eee = this.eee.bind(this);
				this.noeee = this.noeee.bind(this);
				this.handleInput = this.handleInput.bind(this);
				this.handleClick = this.handleClick.bind(this);
				this.handleUser = this.handleUser.bind(this);
				this.handleAdmin = this.handleAdmin.bind(this);
				this.state = {
					input: "",
				};
			}

			handleInput = (e) => {
				this.state.input = e.target.value;
			};

			handleClick = async () => {
				let text = this.state.input;
				if (text.length <= 200 && text.length != 0) {
					let tx = await this.props.store.dPost.addPost(text);
					let receipt = await tx.wait();
					if (receipt.status == 1) {
						this.state.input = null;
						document.getElementById("text").value = "";
					}
				} else {
					if (text.length > 200) {
						alert("Booty too big uwu");
					} else {
						alert("Booty too small >w<");
					}
				}
			};

			handleUser = async () => {
				let text = this.state.input;
				if (text.length == 42) {
					let check = await this.props.store.viewer.checkUser(text);
					if (!check) {
						let tx = await this.props.store.dPost.addUser(text);
						let receipt = await tx.wait();
						if (receipt.status == 1) {
							this.state.input = null;
							document.getElementById("text").value = "";
							alert("Crewmate added");
						}
					}
				} else {
					alert("Format yer address, ye swab");
				}
			};

			handleAdmin = async () => {
				let text = this.state.input;
				if (text.length == 42) {
					let check = await this.props.store.viewer.checkAdmin(text);
					if (!check) {
						let tx = await this.props.store.dPost.addAdmin(text);
						let receipt = await tx.wait();
						if (receipt.status == 1) {
							this.state.input = null;
							document.getElementById("text").value = "";
							alert("Captain added");
						}
					}
				} else {
					alert("Format yer address, ye swab");
				}
			};

			eee = () => {
				var e = document.getElementById("dolphintext");
				e.style.display = "inline";
				var d = document.getElementById("dolphin");
			};

			noeee = () => {
				var e = document.getElementById("dolphintext");
				e.style.display = "none";
			};

			render() {
				return this.props.store.loading ? null : (
					<Box color="white" mx="auto" maxW="500px" textAlign="center">
						<Image id="noselect" my="30px" mx="auto" src={logo} alt="logo" />

						<Image
							id="dolphin"
							className="shake"
							position="fixed"
							bottom="0"
							right="0px"
							maxW="100px"
							src={dolphin}
							alt="dolphin"
							onMouseOver={this.eee}
							onMouseOut={this.noeee}
						/>
						<Box
							id="dolphintext"
							className="shake"
							position="fixed"
							right="0px"
							bottom="0px"
							color="green.200"
							fill="none"
							display="none"
						>
							e̸̢̧̢̢̡̧̨̢̛̛̛̯̠̞̝̙͍̼̯͈̥̱̟̣͇̜͚̱͎̙͚͚̪͇̞̠̜͇͎̙̰̘͉̦͚̳͈̙̤̮̫̱̺̞̱̳͖̩̥̺̬̟̖̜̪̦̼̳̫͍̖̞̩̟̤̻̬͕͚͖͚̤͖͚̼͚͙͚̓̈́̉̈́̒̉͂͊͛̒͋̓́̉̾̍̉͋̈́̀̅̂̿̏̊͐͗̀̂̔̽̄̈́͊̈́͒̊̾̽̿̈́̅̍̍̇̉̑͆̀͂̂͐̈́͆͋̿̍̈̍̅̔̇̍̐̇̒̒͛̋͆̒̑̈̔̀͆͂̄̉́̏̀̃̽͛̒́̍̎̋̏̉̑͋̇̆̇̾͐͒̌̀́̆͐̈̿̃͒̂́̚͘̚̚̕̕̕͜͜͜͝͝͝ͅe̴̢̢̡̧̢̢̡̛̹̙̱̥͈̱̯̺͇̺̞͔͎̠̫͇̟̯̱̦͙̗͙͇͇̰͔̬̼͚̙̬͖͕̼͙̯̻̰͚̫̮̥̖̲̟͗̌̀́͛̈́̔͒̉̾̈́̂̽̾̀̏̋͋̆̐̑̌̓̓͛̓̄́͒̓̿̅̒̄̑̇̾̇̒̌͛͒̅̈́͗̐̅̽͛͗̇͗̒̄̔͌̎̓͐̚̚̚͘̕͜͝͠͝͝͝ͅę̸̨̡̡̢̛̦͎̜̙̼̣̻̟̱͕̝̝̤͍̙̘͖͕̻̩̳̘̝̪͊̀̋̀́̋̏̿̈́͒̈̅͋̆̂͒̽̈́͐͌̄̀̄̃͂̒̊́̐͒̾̏̾̑̔̔̀͂͗̉̈́̈̀̉́̽̆̑̂̅͗͒̈́͂̄̊̈́͗̎́̆̀̽̓͐̿̓̆̾͊̔̅̿̀͆́̇̃̐̍͋̀̓̈́͒̈͗͛̊̈́̓͗̉̓͆̈́̎̈́̋̄̏̀̑͐̈́̈́͑̌̉́͆͑̏͂̈́̑̒̚̕̕̚͘̕͜͝͠͠͠͝͝͝͝͝ͅȇ̷̢̡̢̨̨̢̡̨̡̢͍͉̺̙̠̗͇̘̮̝͙͈̝̤̰̭͙̝̟̱̘̰̪̞̰͕̤͕͓͓͚̱͔̣̙͕̘̘͈̭͇̜͍̩̭̟̹͍̝̮̪̬̣̲̗̞͎̱̯̙̙͎̫̠̻̱̝̹̫͙͖͎͖͈̝̮̮͔̻̗̦̯̝̠͇̭̝̩̱̪̩͓͕̞̩̹͍̬̻͈̹̭̱̖͖̗̥̺̮̱̻̯̤̘̪̝̪̳͈͂͋́̐̅͊̽̓͆̈͋̓̃͑̂̽̿̄̈́̾̓̈̋̄̄̾́̃̀̃͑̈́̒̔͌̌͋͛́̊̈́̊͂̓̃̐̋͋͛̽͗̉͑̎͌͛̌̀̄͋͆̓̈́̽̐̽͌́͌̎̿̈̽͛̒̈́̆̆̓̑̇̂̃́̑͑̎̾̑̾̈́̈́̈̿̀̇̂̄̓̄͘̚̚͜͜͜͝͝͝͠ͅe̵̡̛̛̫̝̗̝̞̞͕̮̣̙̲̥̺̲̺̗̣̬͖̗̝̬̽͑̈̏͐̓̒̽͒̉̇͆͌̽̊̉̔̌̈͗̀͗̎̊̀̀̏̉͆̿̍̽̈́͋͋̃̃͒͛͌̀̿́̒̓͗̈́͗͗̅̓̄̃̇̊̍̂̓̋̿̀̒̾̐̽́͑̉̽̆͌͒͗̄̾̊͊͌̀́͆̊̏̐͑̆͘͘̕̚̚͘͜͝͝͠͝͝͝͝͝͝ͅẻ̶̫̜̼̺̜͖̥̞͔̟͖̪̥͚̦̭̩̹̼͖̒͂̓͒͑͒̓̊̒̐̈́̈́̉̀̔̏̈́̈̓̈́͒̀̐̏͊̀̽͑͐̃̋̑̿͗͛͛̈́̿͋͋̆̚̚͘͘͝͝͝͠͝ͅe̴̡̧̡̡̢̨̧̧̧̡̛̛͍͓̖͉̼͓̙̻͖͍̰͓̭̞̲͖̙̮̣͉̞͕̰̬̲͔͈̞͙̰̜̭̤͓̣̥͓͓̦̮͍͍͍̳̥̣̥͖̪̼̳̤̩͕̲̱̭̳͉̹̫̯͔̝̻̯̮̥͑͌̏̈́͆̎͊͑̾̈́̀̀̿̅̑͊̆̏̐̎̀̊̐̋̅̓̓͑͐̽̓̈́̉̈́́̓́̊́̃̂͒̾̑͋̎́͊̓̿̿̏͂̓̽͌̀͗̈̀̓͆̃̔̌̈́̋̿̃̿̊̑͗̽͐͊͊͋̓͘̚͘̕̕͝ͅͅͅě̸̛̥̻̭͕̹͖͔̗͂̿̃͋͌́̓̓̐̋͛̈́͆̆̀̃̂̌̂̀̕̚͘͜͝ẻ̸̢̡̨̢̨̨͓̟̩̫͈̺̫̤̳̙̻̫͓͙̠̬̖̙̱͓̦͖̻̰̮̱̬͍͉͙̥̗͚͖͕̗͚̻̣̤̥̺̱̮͍̝̩͖̞͚̼̯̻̭͚̤̤̳̫̭̫̼̹̻̫̼͉̘̼̠̹̼̜̱͚̺͎̼̘͎̫̗̹̭͑͑̃͂̂̇̒͒̔͂̓̉̋̂͆͂̆̓́̐̉͂̄̕͜͜͜͝͠͝ͅͅͅͅḛ̶̡̧̡̡̢̢̧͎̹͚̩̜͎̲͙̘̗̳̖̖̮̜͎̲̗̗̻̯͈̺̭̘̬̙͍͔̰͚̩̠̯̯̖̘̜̭̱̥͍̩͎̭̟̥͖̬͈̭͙͆̐̍̈́̀̈́̇̒̾̈͊̐͛̾̃̓͗̎̈̀̋͐͊̃̿͊̈́̉̈́̋̿̏͌̈́́̉̄̇̂̿̍̀̇͒͆̑̃́̏̓̏̊͌́̒̇͛̉̓̀̒̈̂́́̓̈́͒͛̍̊͊̄̔̀̍̕̚͘̚͜͜͠͝͠͝͠͝ͅę̸̡̢̨̡̢̡̡̢̨̨̧̨̡̺͙͈̟͕͉̟̦̩̘̝̺̭̗̰͖̩̭͓̘̠͍̘̻̝̹̖̙̦͕̘͍̟̖̜̯̞͎͎͚̯̺͓̥͍̫̞̯͎̪̬̜͍̳͉̦̻̪͍̭̣͚͚̭̠͖͓̣̺̜͉̩͙̘̯̤̥̫̩̪͚̹̦̖͕̘͎͖͎̮͙̻̞͕̭͍̹̼̋̓͂̈́̈́̑̏̿̈͜͠ͅͅͅͅé̸̢̧̢̡̛̛̠̥̪͔͉̞̗̱̞̗̫͖̹̗̠̳̦̞͓̣͇̳̦̤̺̠̜̰̼̹̦̞͔͕̏̏͊͂͐̿̎͗̎͛̆͒̑̊̑̿̈́̉̉̔͊̐͑̀̓͊͑̓̿͗͂̈̇͊͑̇̒̒̈́̽̔̾̓͑͊̊̂͐̿̌̌͑̆͛̓͆͌͆̊͗̄̕͘͘͘̕͝͝͝͠ͅͅͅḙ̵̢̨̡̧̨̢̢̢̨̧̨̧̨̢̨̨̢̢̡̛͈̼͇̞͎̞͕͔̟̫͔̼̤̫̣̹̩̘̥̰̥̙̤̱͈̝̠̰̩̬̪̣̠̹͓̠̳̼̞̤̩̹̥͔̪̠̩͉̘̟̬̱̝͓̞̹͈͙͎̭̳̦͍̙̟̘̼̪̼̭̰͈̭͖̙͙̝̬͇͎̜̻̞̩̤̟͈̹̺̗̭̘̣͍͕̰̬̪̝̬͓͉̂̈́͐͊̏̉̃̈̈́̓̈́̎̋̊̎̑̀̀́͆̽̋̆̍̂̅̌̇̉͗̿͊̌̅̓͌̆̍͊̉͊̍̑̓̽̒̌̇̔̆̋̐̓̂̓̍̿̽͋̀͌̋̈́̽̅͋͊̄̓̎̀̆́̉̚̕̕̚͜͜͜͜͜͜͜͝͠͝͝ͅͅe̶̡̢̳͈̟̥͎̳͈͈̤̺̦̳̩̥͚̣̘̻̼͛͗͐͛͒̃̈̃͒͛͋̐̈́̓̈̾̅̌̾̄͋͘͘͝͝ë̸̛̥̯̐͛͆́̄̂͂̏̄̅̀͌͑̑̊̍̓͆͛̈́̔̑́̓̎̍̒̍͑͊̐͑̌͛͆͐͗̂̃̂͆̇́̂̂̀̉̍̊͂̆͆̍́̍͊̓̓̉̈́̓̋́͗͊̑̓̋̆̐̈́͗͌̔̒͑͛̒͗̈́͗̓̽̂̈́̆̕͘̕̚̚̚̚͘͝͠͝͝͠ȩ̵̨̢̧̡̘̻̪͖̯̰̝͚͓̣̦͖̲͕͓̪͙͈͖͉̻̠͎̳͉͍͇̹͈͉̦̘̫̺̙̝̦̦̼̦̩̙̫͈͙͖͓̭̦̤̗̘̰͖̤̩͉̰̩̤̘̺̱̲̘̤̻̯̼̞̐͌͑̋̈́̉̈̑̄̽͊̒̓̈̀͑̀̓̉̀̑͗̏̈̐͂̓̑͆̈̽͌͂̉͆̈͆͊̇̊͗̃́̂̉͗̐̐̉͊̂͗̈́̂̄̊̑͒̒͊̈́͋̄̃͑̒͛́̃̓̃̽̓̔̀̂̆̃͌̽̊̃̒̈̾̽̒̍̇̏͗́͗̉͂̽̆͌̂̈́̿̀͛̀̓̾̍̊̒̏̕̚̕͘̕̕͠͝͝e̸̡̧̢̡̧̨̨̡̧̨̨̡̢̨̢̛̛̛̺̹͎͙͍͔̬̖̙̖͚͈̼͈͈̝̠̜͔̲̻͎̰̬̠̲̱̤͙̘̹̙̖̻̜̙͕͇͕͔͈̙͕̦̩̪̪̤̟̠̝̻͉̻̖̺̣̻̗̬̙̰̤̯͍̻͔͓͓͎͈̘͇̭̗̯̫̜͓̗͇͈̳̳̭͍̹̭̙͕͍̮̳̰̳̤̬̪͍̭̩̗̻͔͍͖̫̺̦̘͔͐͑̓̂͑̎́͋͊̏́̊̏̂̆̿͗̂͛́͗̉͋̉͐̉͑̾͑̑̀́͊̐̀̔̽́͆̓̄͆̅̋̀̇̀̀̊̉͆̍̇͊͋̀͂̈̇̋͛̏̈͌͛̍̑̎̆̆̌̔̓͊̆͑̅̐̏͆̉̈́̌̿̋̈́͆̓̏̓͂̐̎̂̾̐̓͒̊͛̅̑̍̎̓̍̔́̕͘͘̕͘͜͜͝͠͝͠͝͝͝͝͝͝ͅe̸̢̢̢̨̨̢̨̨̢̛̛̛̫̱̱̗͚͕̙̭͓͎͙͕͖̞̗̺̹̤̰͇̪̰̙̘͓͕͎͍̻̯͉̪̟̺̮͓͓̯̣̭̭̱͎̯̰͈̳̭̫̲͎͙͙̰̰̠̝̣̮̻̻̝̙̪̻̲̬̗̜̞̗͉̜͔͚̪̖̟͍͉͔̤̘͈͚͓̝̰̫̫͍̻̞̗̜̖͍͚̟̘̮͙͑̊̔̀̌̃̄̓̀̅̀͂͒̊͌̃͋͒͊̈́̏̓̔̃̎̅̐̒̔̓͂͐͊̾̋̈̋͑̐̃̆̑́̀͊̀͂͂̍̄̈́̐̐͛͋̽̄͒͒̊̔̈̀͆̊̈́̋͌̌̒̾̌̄̒̊͐̽̈͒̃̉̉̓͗͂̇͗̓̑̍̓̊́̆́̉̄̀̋̇̿͆̀̈́̅̏͘͘̚̕͘̚̚͘͜͜͜͜͜͠͝͝͠͝͝͝͠ͅę̷̢̨̧̡̢̗̖̜̼͙̜͎̦͍̹͉̘͉̝̙̥͕̲̞̹͚͓͕͔̟̰͇̼̼͖͖͚̺̬͉͓̣͖̩̭̥͈̖̙̰̬̟͚̱̩̣̗̮̰̤̳̙̪͇̭̝̱͙̪̼͓̩̮̜̲̭̗̣̠̹̻̗̺̻͖͙̥̭̗͈̩̲̪̠̠͍̭̱̦̥̖̱̩̹̯̮͂͊̓͗͒̍̈́̉͊̌͑͛̀͜͜ͅͅȩ̵̧̢̡̧̡̧̡̧̡̨̢̧̧̛̛̛̲̘̣̮̮̤͇̠̼̹̝͇̪̲̜̰͉̣̲͚̬̺̝̤̖̣͓̟̦̣̞̭̱͍̹͚͇̮͚̘͖̲̲͓̝̲̩̘̣̗̗̬͓̘̗͉̯̰̲̺̘͇̗̜̱̞͖̰̻͔͍͉͖̰̩̯̞͙͎̯̞̞̼̠͔̖̟͚͇̙̭̫͖̬̠͚̤͖̟͔͈̹̖͖̯̰̬̖͉̝̙̱̰͙͕̥́̋̋̍̑͒̌̂͆̽́̈́͊̈́̐̒̈́̇̀̀̐͌̉̑͑́̽̎͗͆̊͛͐̀̅̀̌͊̊̓͌̏͗̑͐̐̅̽̽̋͐̎́̓̀̔̍̽͂̉͗͑́̔̍̍̈̾̏̌͆̋̓͋̒̊̐̒͛͑̌̀̾̕̚̕̕̚͘͘̚͜͝͝͝͠͠͝͠͠͝ͅȩ̷̡̨̡̢̨̡̡̧̡̧̛̛̞̭̟͈̘̞͉͍̭̜̘͔̩̗̦̪̭̻̦͔̥̤͉̤̜̩̳͖̘̦͍̩̹̺͉̖̩̪̻͉̳̭̩͙͖͉͖̮̫̺͚̟͉̙̻̖̻̤͈̞̲̩̩͙̝̠͔͉̳̞̪̬̰͇͖̣̮̘̞͈̹̗̜͙̪͎̝͓͉̃̄̅͊̋́̒̄̓̍̐̑̾̓̌̿̂̓̉̂͒̐̓̊͂͊̕͜͠ͅͅͅͅe̸̡̡̡̨̨̧̢̡̡̢̢̨̧̛͉͙̦̗͙̫͇̜̣͚̯̥̹̣̳̞̖̤͇͎̜͔̜̘̥̙̻̬͚̪̙͕̞̙͚̳͕̫̣̣̳̺͈͓̬̺͓̝̬̣̝͚͎͓̣͈͕͓̻̩̼̗̮̤̬͉̝͓̟̲̥͔̗̓̊̾̐̀̾̄͋͛̊̈́̾̅̾̈́͒̍́̅͂͊̍̃͐̏͆̐͑̅̔̏̒͑̀͗̚̚̕̕͘͜͜͝͠͠ͅḙ̶̡̢̨̨̨̨̨̡̢̨̲͓͕͖͉̥̩͎̰̩͓̯̼̙̩̞̳̲̺̻͖͔̲̟̙͚̤̗̪͚̯̫̣̥̺̬͉͚̬͙̖̜̰̱̘̳̹͕͎̪̭̭̘̦͖̠̯̙͇̹̳̜̞̺̥͔͇̖̜͍̪̺̮͕̖͈̤͙̭̘͍̦͉̖͚̼̝͖̥͎͓̟̩͖̲͐̿͠ͅͅę̴̢̡̡̛̼̳̞͇̩̗̰̦̤̰̻͇̗͉̭̞̰̖͇̟̱̲̭̻̲̙̙͈̙̅͆̽̀̀͐̒͒̂́̄̔͐̒̔̈́̌̌̔͋̊̏̾͒̍̒̿̀̍̊̉̿̈́̎̀̑̋̿͊̓̈̎́̽̅̏̓̏̓͊̆̄̆̊̚͘͝͠ͅͅe̸̡̡̨̗̠̟̯̭̰̰̠̝̘̣̜̗͔̯̝̮̱͕͍̘͉̮̭̫̠̯̩͍̼͈̲̻̞̥͙͇̻̝̭̪̝̝̠̫̣͎͕̦̙͍̞̼͎̩̰͔̰̳̭̱̘̜̪͈͇̬̖̮͈̣̠̒͛̉͊͐͌̔̓́͐̅̇̃̆̉̓͛͑͐̍̈́͊̏̉̌͜͜͝͝͝͝ͅͅͅe̸̢̧̢̢̡̧̨̢̛̛̛̯̠̞̝̙͍̼̯͈̥̱̟̣͇̜͚̱͎̙͚͚̪͇̞̠̜͇͎̙̰̘͉̦͚̳͈̙̤̮̫̱̺̞̱̳͖̩̥̺̬̟̖̜̪̦̼̳̫͍̖̞̩̟̤̻̬͕͚͖͚̤͖͚̼͚͙͚̓̈́̉̈́̒̉͂͊͛̒͋̓́̉̾̍̉͋̈́̀̅̂̿̏̊͐͗̀̂̔̽̄̈́͊̈́͒̊̾̽̿̈́̅̍̍̇̉̑͆̀͂̂͐̈́͆͋̿̍̈̍̅̔̇̍̐̇̒̒͛̋͆̒̑̈̔̀͆͂̄̉́̏̀̃̽͛̒́̍̎̋̏̉̑͋̇̆̇̾͐͒̌̀́̆͐̈̿̃͒̂́̚͘̚̚̕̕̕͜͜͜͝͝͝ͅe̴̢̢̡̧̢̢̡̛̹̙̱̥͈̱̯̺͇̺̞͔͎̠̫͇̟̯̱̦͙̗͙͇͇̰͔̬̼͚̙̬͖͕̼͙̯̻̰͚̫̮̥̖̲̟͗̌̀́͛̈́̔͒̉̾̈́̂̽̾̀̏̋͋̆̐̑̌̓̓͛̓̄́͒̓̿̅̒̄̑̇̾̇̒̌͛͒̅̈́͗̐̅̽͛͗̇͗̒̄̔͌̎̓͐̚̚̚͘̕͜͝͠͝͝͝ͅę̸̨̡̡̢̛̦͎̜̙̼̣̻̟̱͕̝̝̤͍̙̘͖͕̻̩̳̘̝̪͊̀̋̀́̋̏̿̈́͒̈̅͋̆̂͒̽̈́͐͌̄̀̄̃͂̒̊́̐͒̾̏̾̑̔̔̀͂͗̉̈́̈̀̉́̽̆̑̂̅͗͒̈́͂̄̊̈́͗̎́̆̀̽̓͐̿̓̆̾͊̔̅̿̀͆́̇̃̐̍͋̀̓̈́͒̈͗͛̊̈́̓͗̉̓͆̈́̎̈́̋̄̏̀̑͐̈́̈́͑̌̉́͆͑̏͂̈́̑̒̚̕̕̚͘̕͜͝͠͠͠͝͝͝͝͝ͅȇ̷̢̡̢̨̨̢̡̨̡̢͍͉̺̙̠̗͇̘̮̝͙͈̝̤̰̭͙̝̟̱̘̰̪̞̰͕̤͕͓͓͚̱͔̣̙͕̘̘͈̭͇̜͍̩̭̟̹͍̝̮̪̬̣̲̗̞͎̱̯̙̙͎̫̠̻̱̝̹̫͙͖͎͖͈̝̮̮͔̻̗̦̯̝̠͇̭̝̩̱̪̩͓͕̞̩̹͍̬̻͈̹̭̱̖͖̗̥̺̮̱̻̯̤̘̪̝̪̳͈͂͋́̐̅͊̽̓͆̈͋̓̃͑̂̽̿̄̈́̾̓̈̋̄̄̾́̃̀̃͑̈́̒̔͌̌͋͛́̊̈́̊͂̓̃̐̋͋͛̽͗̉͑̎͌͛̌̀̄͋͆̓̈́̽̐̽͌́͌̎̿̈̽͛̒̈́̆̆̓̑̇̂̃́̑͑̎̾̑̾̈́̈́̈̿̀̇̂̄̓̄͘̚̚͜͜͜͝͝͝͠ͅe̵̡̛̛̫̝̗̝̞̞͕̮̣̙̲̥̺̲̺̗̣̬͖̗̝̬̽͑̈̏͐̓̒̽͒̉̇͆͌̽̊̉̔̌̈͗̀͗̎̊̀̀̏̉͆̿̍̽̈́͋͋̃̃͒͛͌̀̿́̒̓͗̈́͗͗̅̓̄̃̇̊̍̂̓̋̿̀̒̾̐̽́͑̉̽̆͌͒͗̄̾̊͊͌̀́͆̊̏̐͑̆͘͘̕̚̚͘͜͝͝͠͝͝͝͝͝͝ͅẻ̶̫̜̼̺̜͖̥̞͔̟͖̪̥͚̦̭̩̹̼͖̒͂̓͒͑͒̓̊̒̐̈́̈́̉̀̔̏̈́̈̓̈́͒̀̐̏͊̀̽͑͐̃̋̑̿͗͛͛̈́̿͋͋̆̚̚͘͘͝͝͝͠͝ͅe̴̡̧̡̡̢̨̧̧̧̡̛̛͍͓̖͉̼͓̙̻͖͍̰͓̭̞̲͖̙̮̣͉̞͕̰̬̲͔͈̞͙̰̜̭̤͓̣̥͓͓̦̮͍͍͍̳̥̣̥͖̪̼̳̤̩͕̲̱̭̳͉̹̫̯͔̝̻̯̮̥͑͌̏̈́͆̎͊͑̾̈́̀̀̿̅̑͊̆̏̐̎̀̊̐̋̅̓̓͑͐̽̓̈́̉̈́́̓́̊́̃̂͒̾̑͋̎́͊̓̿̿̏͂̓̽͌̀͗̈̀̓͆̃̔̌̈́̋̿̃̿̊̑͗̽͐͊͊͋̓͘̚͘̕̕͝ͅͅͅě̸̛̥̻̭͕̹͖͔̗͂̿̃͋͌́̓̓̐̋͛̈́͆̆̀̃̂̌̂̀̕̚͘͜͝ẻ̸̢̡̨̢̨̨͓̟̩̫͈̺̫̤̳̙̻̫͓͙̠̬̖̙̱͓̦͖̻̰̮̱̬͍͉͙̥̗͚͖͕̗͚̻̣̤̥̺̱̮͍̝̩͖̞͚̼̯̻̭͚̤̤̳̫̭̫̼̹̻̫̼͉̘̼̠̹̼̜̱͚̺͎̼̘͎̫̗̹̭͑͑̃͂̂̇̒͒̔͂̓̉̋̂͆͂̆̓́̐̉͂̄̕͜͜͜͝͠͝ͅͅͅͅḛ̶̡̧̡̡̢̢̧͎̹͚̩̜͎̲͙̘̗̳̖̖̮̜͎̲̗̗̻̯͈̺̭̘̬̙͍͔̰͚̩̠̯̯̖̘̜̭̱̥͍̩͎̭̟̥͖̬͈̭͙͆̐̍̈́̀̈́̇̒̾̈͊̐͛̾̃̓͗̎̈̀̋͐͊̃̿͊̈́̉̈́̋̿̏͌̈́́̉̄̇̂̿̍̀̇͒͆̑̃́̏̓̏̊͌́̒̇͛̉̓̀̒̈̂́́̓̈́͒͛̍̊͊̄̔̀̍̕̚͘̚͜͜͠͝͠͝͠͝ͅę̸̡̢̨̡̢̡̡̢̨̨̧̨̡̺͙͈̟͕͉̟̦̩̘̝̺̭̗̰͖̩̭͓̘̠͍̘̻̝̹̖̙̦͕̘͍̟̖̜̯̞͎͎͚̯̺͓̥͍̫̞̯͎̪̬̜͍̳͉̦̻̪͍̭̣͚͚̭̠͖͓̣̺̜͉̩͙̘̯̤̥̫̩̪͚̹̦̖͕̘͎͖͎̮͙̻̞͕̭͍̹̼̋̓͂̈́̈́̑̏̿̈͜͠ͅͅͅͅé̸̢̧̢̡̛̛̠̥̪͔͉̞̗̱̞̗̫͖̹̗̠̳̦̞͓̣͇̳̦̤̺̠̜̰̼̹̦̞͔͕̏̏͊͂͐̿̎͗̎͛̆͒̑̊̑̿̈́̉̉̔͊̐͑̀̓͊͑̓̿͗͂̈̇͊͑̇̒̒̈́̽̔̾̓͑͊̊̂͐̿̌̌͑̆͛̓͆͌͆̊͗̄̕͘͘͘̕͝͝͝͠ͅͅͅḙ̵̢̨̡̧̨̢̢̢̨̧̨̧̨̢̨̨̢̢̡̛͈̼͇̞͎̞͕͔̟̫͔̼̤̫̣̹̩̘̥̰̥̙̤̱͈̝̠̰̩̬̪̣̠̹͓̠̳̼̞̤̩̹̥͔̪̠̩͉̘̟̬̱̝͓̞̹͈͙͎̭̳̦͍̙̟̘̼̪̼̭̰͈̭͖̙͙̝̬͇͎̜̻̞̩̤̟͈̹̺̗̭̘̣͍͕̰̬̪̝̬͓͉̂̈́͐͊̏̉̃̈̈́̓̈́̎̋̊̎̑̀̀́͆̽̋̆̍̂̅̌̇̉͗̿͊̌̅̓͌̆̍͊̉͊̍̑̓̽̒̌̇̔̆̋̐̓̂̓̍̿̽͋̀͌̋̈́̽̅͋͊̄̓̎̀̆́̉̚̕̕̚͜͜͜͜͜͜͜͝͠͝͝ͅͅe̶̡̢̳͈̟̥͎̳͈͈̤̺̦̳̩̥͚̣̘̻̼͛͗͐͛͒̃̈̃͒͛͋̐̈́̓̈̾̅̌̾̄͋͘͘͝͝ë̸̛̥̯̐͛͆́̄̂͂̏̄̅̀͌͑̑̊̍̓͆͛̈́̔̑́̓̎̍̒̍͑͊̐͑̌͛͆͐͗̂̃̂͆̇́̂̂̀̉̍̊͂̆͆̍́̍͊̓̓̉̈́̓̋́͗͊̑̓̋̆̐̈́͗͌̔̒͑͛̒͗̈́͗̓̽̂̈́̆̕͘̕̚̚̚̚͘͝͠͝͝͠ȩ̵̨̢̧̡̘̻̪͖̯̰̝͚͓̣̦͖̲͕͓̪͙͈͖͉̻̠͎̳͉͍͇̹͈͉̦̘̫̺̙̝̦̦̼̦̩̙̫͈͙͖͓̭̦̤̗̘̰͖̤̩͉̰̩̤̘̺̱̲̘̤̻̯̼̞̐͌͑̋̈́̉̈̑̄̽͊̒̓̈̀͑̀̓̉̀̑͗̏̈̐͂̓̑͆̈̽͌͂̉͆̈͆͊̇̊͗̃́̂̉͗̐̐̉͊̂͗̈́̂̄̊̑͒̒͊̈́͋̄̃͑̒͛́̃̓̃̽̓̔̀̂̆̃͌̽̊̃̒̈̾̽̒̍̇̏͗́͗̉͂̽̆͌̂̈́̿̀͛̀̓̾̍̊̒̏̕̚̕͘̕̕͠͝͝e̸̡̧̢̡̧̨̨̡̧̨̨̡̢̨̢̛̛̛̺̹͎͙͍͔̬̖̙̖͚͈̼͈͈̝̠̜͔̲̻͎̰̬̠̲̱̤͙̘̹̙̖̻̜̙͕͇͕͔͈̙͕̦̩̪̪̤̟̠̝̻͉̻̖̺̣̻̗̬̙̰̤̯͍̻͔͓͓͎͈̘͇̭̗̯̫̜͓̗͇͈̳̳̭͍̹̭̙͕͍̮̳̰̳̤̬̪͍̭̩̗̻͔͍͖̫̺̦̘͔͐͑̓̂͑̎́͋͊̏́̊̏̂̆̿͗̂͛́͗̉͋̉͐̉͑̾͑̑̀́͊̐̀̔̽́͆̓̄͆̅̋̀̇̀̀̊̉͆̍̇͊͋̀͂̈̇̋͛̏̈͌͛̍̑̎̆̆̌̔̓͊̆͑̅̐̏͆̉̈́̌̿̋̈́͆̓̏̓͂̐̎̂̾̐̓͒̊͛̅̑̍̎̓̍̔́̕͘͘̕͘͜͜͝͠͝͠͝͝͝͝͝͝ͅe̸̢̢̢̨̨̢̨̨̢̛̛̛̫̱̱̗͚͕̙̭͓͎͙͕͖̞̗̺̹̤̰͇̪̰̙̘͓͕͎͍̻̯͉̪̟̺̮͓͓̯̣̭̭̱͎̯̰͈̳̭̫̲͎͙͙̰̰̠̝̣̮̻̻̝̙̪̻̲̬̗̜̞̗͉̜͔͚̪̖̟͍͉͔̤̘͈͚͓̝̰̫̫͍̻̞̗̜̖͍͚̟̘̮͙͑̊̔̀̌̃̄̓̀̅̀͂͒̊͌̃͋͒͊̈́̏̓̔̃̎̅̐̒̔̓͂͐͊̾̋̈̋͑̐̃̆̑́̀͊̀͂͂̍̄̈́̐̐͛͋̽̄͒͒̊̔̈̀͆̊̈́̋͌̌̒̾̌̄̒̊͐̽̈͒̃̉̉̓͗͂̇͗̓̑̍̓̊́̆́̉̄̀̋̇̿͆̀̈́̅̏͘͘̚̕͘̚̚͘͜͜͜͜͜͠͝͝͠͝͝͝͠ͅę̷̢̨̧̡̢̗̖̜̼͙̜͎̦͍̹͉̘͉̝̙̥͕̲̞̹͚͓͕͔̟̰͇̼̼͖͖͚̺̬͉͓̣͖̩̭̥͈̖̙̰̬̟͚̱̩̣̗̮̰̤̳̙̪͇̭̝̱͙̪̼͓̩̮̜̲̭̗̣̠̹̻̗̺̻͖͙̥̭̗͈̩̲̪̠̠͍̭̱̦̥̖̱̩̹̯̮͂͊̓͗͒̍̈́̉͊̌͑͛̀͜͜ͅͅȩ̵̧̢̡̧̡̧̡̧̡̨̢̧̧̛̛̛̲̘̣̮̮̤͇̠̼̹̝͇̪̲̜̰͉̣̲͚̬̺̝̤̖̣͓̟̦̣̞̭̱͍̹͚͇̮͚̘͖̲̲͓̝̲̩̘̣̗̗̬͓̘̗͉̯̰̲̺̘͇̗̜̱̞͖̰̻͔͍͉͖̰̩̯̞͙͎̯̞̞̼̠͔̖̟͚͇̙̭̫͖̬̠͚̤͖̟͔͈̹̖͖̯̰̬̖͉̝̙̱̰͙͕̥́̋̋̍̑͒̌̂͆̽́̈́͊̈́̐̒̈́̇̀̀̐͌̉̑͑́̽̎͗͆̊͛͐̀̅̀̌͊̊̓͌̏͗̑͐̐̅̽̽̋͐̎́̓̀̔̍̽͂̉͗͑́̔̍̍̈̾̏̌͆̋̓͋̒̊̐̒͛͑̌̀̾̕̚̕̕̚͘͘̚͜͝͝͝͠͠͝͠͠͝ͅȩ̷̡̨̡̢̨̡̡̧̡̛̛̞̭̟͈̘̞͉͍̭̜̘͔̩̗̦̪̭̻̦͔̥̤͉̤̜̩̳͖̘̦͍̩̹̺͉̖̩̪̻͉̳̭̩͙͖͉͖̮̫̺͚̟͉̙̻̖̻̤͈̞̲̩̩͙̝̠͔͉̳̞̪̬̰͇͖̣̮̘̞͈̹̗̜͙̪͎̃̄̅͊̋́̒̄̓̍̐̑̾̓̌̿̂̓̉̂͒̐̓̊͂͊̕͜͠ͅͅͅͅ
						</Box>
						<Box my="10px">DeFi Pirate Cove on Web 3.0</Box>
						<Box
							textAlign="center"
							mx="auto"
							display="flex"
							flexDirection="row"
							justifyContent="center"
						>
							{this.props.store.userRole == "Admin" ? (
								<Box my="10px">Welcome aboard, captain.</Box>
							) : this.props.store.userRole == "User" ? (
								<Box my="10px">Welcome aboard, matey.</Box>
							) : (
								<Box my="10px">See the quartermaster for your papers.</Box>
							)}
							{this.props.store.userRole == "User" ? (
								this.props.store.timer[0] >= this.props.store.timer[1] ? (
									<Box ml="7px" my="10px">
										You are free to set sail.
									</Box>
								) : (
									<Box ml="7px" my="10px">
										{"Port opens in " +
											Math.ceil(
												(new Date(this.props.store.timer[1]) -
													new Date(this.props.store.timer[0])) /
													60
											) +
											" minutes."}
									</Box>
								)
							) : null}
							{this.props.store.userRole == "Admin" ? (
								this.props.store.timer[0] >= this.props.store.timer[1] ? (
									<Box ml="7px" my="10px">
										You are free to set sail.
									</Box>
								) : (
									<Box ml="7px" my="10px">
										{"Port opens in " +
											Math.ceil(
												(new Date(this.props.store.timer[1]) -
													new Date(this.props.store.timer[0])) /
													60
											) +
											" minutes."}
									</Box>
								)
							) : null}
						</Box>
						{this.props.store.userRole == "Admin" ||
						this.props.store.userRole == "User" ? (
							<Fragment>
								<Textarea
									id="text"
									onChange={this.handleInput}
									color="black"
									placeholder="Create <= 200 character post, or add new crewmates by address"
									height="50px"
								></Textarea>
								<Box
									display="flex"
									flexDirection="row"
									justifyContent="space-around"
								>
									<Button
										variantColor="green"
										mt="7px"
										w="150px"
										onClick={this.handleClick}
									>
										Drop Anchor
									</Button>
									<Button
										variantColor="purple"
										mt="7px"
										w="150px"
										onClick={this.handleUser}
									>
										Add Crewmate
									</Button>
									{this.props.store.userRole == "Admin" ? (
										<Button
											mt="7px"
											w="150px"
											variantColor="yellow"
											onClick={this.handleAdmin}
										>
											Add Captain
										</Button>
									) : null}
								</Box>
							</Fragment>
						) : (
							<Box>You must be a shipmate to post.</Box>
						)}
					</Box>
				);
			}
		}
	)
);

export default TitleObserver;
